{
  "questions": [
    {
      "qType": "MMCQ",
      "passageId": null,
      "qText": "A square loop ABCD of edge a moves to the right with a velocity \\(v\\), parallel to AB. There is a uniform magnetic field of magnitude \\(B\\), directed into the paper, in the region between PQ and RS only. I, II and III are three positions of the loop.",
      "image": "1.png",
      "qOptions": [
        "the emf induced in the loop has magnitude \\(B a v\\) in all three positions",
        "the induced emf is zero in position II",
        "The induced emf is anticlockwise in position I",
        "The induced emf is clockwise in position III"
      ],
      "qAnswer": ["B", "C", "D"]
    },
    {
      "qType": "MMCQ",
      "passageId": null,
      "qText": "An aluminium ring B faces an electromagnet A. The current i through A can be altered:",
      "image": "2.png",
      "qOptions": [
        "if i increases, A will repel B",
        "if i increases, A will attract B",
        "If i decreases, A will attract B",
        "if i decreases, A will repel B"
      ],
      "qAnswer": ["A", "C"]
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "Three identical coils are arranged coaxially as shown in the figure. B and C are fixed and a constant current passes in C in anti clockwise direction.\n\nAssertion: If coil A carrying same amount of current as that of C is moved towards B, current will induce in B either in clock wise or anti clock wise directions\n\nReason: Current can’t be induced in B by moving A alone, as C is also carrying the same magnitude of current which will nullify the induction effect caused by movement of A.",
      "image": "3.png",
      "qOptions": [
        "Both Assertion and Reason are true and Reason is the correct explanation of Assertion.",
        "Both Assertion and Reason are true but Reason is not the correct explanation of Assertion.",
        "Assertion is true but Reason is false.",
        "Assertion is false but Reason is true."
      ],
      "qAnswer": "C"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "The figure shows certain wire segments joined together to form a coplanar loop. The loop is placed in a magnetic field which is perpendicular to the plane of the figure. The magnitude of the field increases with time. I1 and I2 are the currents in the segments ab and cd. Then",
      "image": "4.png",
      "qOptions": [
        "I1 > I2",
        "I1 < I2",
        "I1 is in the direction ba and I2 is in the direction cd.",
        "I1 is in the direction ab and I2 is in the direction d."
      ],
      "qAnswer": "D"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "A conducting square loop of side L and resistance R moves in its plane with a uniform velocity v perpendicular to one of its sides. A magnetic induction B, constant in time and space, pointing perpendicular and into the plane of the loop exists everywhere. The current induced in the loop is",
      "image": "5.png",
      "qOptions": [
        "B vR clockwise",
        "BLv/R anticlockwise",
        "2BLv/R anticlockwise",
        "zero"
      ],
      "qAnswer": "D"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "A long straight conductor is placed along axis of a circular coil of radius R. If the current , as shown in figure, starts decreasing with time, the current induced in loop would be",
      "image": "6.png",
      "qOptions": [
        "clockwise (ACB)",
        "anticlockwise (ABC)",
        "can not be decided",
        "there will be no induced current."
      ],
      "qAnswer": "D"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "As shown in the figure, P and Q are two coaxial conducting loops separated by some distance. When the switch S is closed, a clockwise current IP flows in P (as seen by E) and an induced current IQ1 flows in Q. The switch remains closed for a long time. When S is opened, a current IQ2 flows in Q. Then the direction IQ1 and IQ2 (as seen by E) are",
      "image": "7.png",
      "qOptions": [
        "respectively clockwise and anti-clockwise.",
        "both clockwise.",
        "both anti-clockwise.",
        "respectively anti-clockwise and clockwise."
      ],
      "qAnswer": "D"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "A magnet placed vertically is falling freely over a cylindrical coil placed over a horizontal surface as shown. The acceleration of the magnet is",
      "image": "8.png",
      "qOptions": [
        "equal to g",
        "greater that g",
        "less than g",
        "directed upwards."
      ],
      "qAnswer": "C"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "The diametric opposite points (1 & 2) of a conducting ring are joined together. If the magnetic field B starts diminishing with time, indicate the direction of current in the wire 1-2.",
      "image": "9.png",
      "qOptions": [
        "right to left",
        "left to right",
        "No current",
        "None of these"
      ],
      "qAnswer": "C"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "A cylindrical magnet is placed near a circular coil. The magnet is rotated about its own axis as shown in figure. The induced current in the coil is :",
      "image": "10.png",
      "qOptions": [
        "zero",
        "in anticlockwise direction",
        "in clockwise direction",
        "directly proportional to the speed of rotation \\(\\omega\\)"
      ],
      "qAnswer": "A"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "The two loops shown in the figure have their planes parallel to each other A current flows in the loop X. The two coils will repel each other if the current in the loop X is",
      "image": "11.png",
      "qOptions": ["increasing", "decreasing", "constant", "None of these"],
      "qAnswer": "B"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "A rectangular coil ABCD is rotated anticlockwise with a uniform angular velocity about the axis shown in figure. The axis of rotation of the coil as well as the magnetic field B are horizontal. The induced emf in the coil would be maximum when :",
      "image": "12.png",
      "qOptions": [
        "the plane of the coil is vertical.",
        "The plane of the coil makes an angle 45\\(^{\\circ}\\) with the magnetic field.",
        "the plane of the coil is parallel to the magnetic field",
        "the plane of the coil makes an angle 30\\(^{\\circ}\\) with the magnetic field."
      ],
      "qAnswer": "A"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "If a rectangular conducting frame lying in normal magnetic field is connected to a condenser and is moved out with velocity V as shown in the diagram. Then",
      "image": "13.png",
      "qOptions": [
        "Plate A will get positively charged",
        "Neither plate A nor Plate B is charged",
        "Plate B will get positively charged",
        "Both plates will get positively charged"
      ],
      "qAnswer": "A"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "Flux \\(\\phi\\) (in weber) in a closed circuit of resistance 10\\(\\Omega\\) varies with time t (in seconds) according to the equation \\(\\phi = 6t^2 - 5t + 1\\). The magnitude of the induced current in the circuit at \\(t = 0.25 s\\) is",
      "image": "14.png",
      "qOptions": ["0.2 A", "0.6 A", "0.8 A", "1.2 A"],
      "qAnswer": "A"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "An equilateral triangular conducting loop of side a and resistance R is placed adjacent to a current carrying long straight wire in same plane, such that distance between wire and side of loop is d. Current is given as \\( I = I_0 \\sin \\omega t\\), then find the current in the loop as function of time.\n\n(Options are made-up distractors; one is correct.)",
      "image": "15.png",
      "qOptions": [
        "\\(I_e=\\dfrac{\\mu_0 I_0}{2\\pi \\beta R}\\left\\{\\left(d+\\dfrac{a v \\beta}{2}\\right)\\ln\\!\\left(1+\\dfrac{a v \\beta}{2 d}\\right)-\\dfrac{a v \\beta}{2}\\right\\}\\)",
        "\\(I_e=\\dfrac{\\mu_0 I_0}{2\\pi R}\\left\\{d\\ln\\!\\left(1+\\dfrac{a v}{2 d}\\right)-\\dfrac{a v}{4}\\right\\}\\)",
        "\\(I_e=\\dfrac{\\mu_0 I_0}{\\pi \\beta R}\\left\\{\\left(d+\\dfrac{a v \\beta}{4}\\right)\\ln\\!\\left(1+\\dfrac{a v \\beta}{d}\\right)-\\dfrac{a v \\beta}{2}\\right\\}\\)",
        "\\(I_e=\\dfrac{\\mu_0 I_0}{4\\pi \\beta R}\\left\\{d\\ln\\!\\left(1+\\dfrac{a v \\beta}{2 d}\\right)\\right\\}\\)"
      ],
      "qAnswer": "A"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "An equilateral triangular loop PQR of side a is at the edge of a uniform magnetic field B at t = 0 as shown in figure. It is pulled to the right with a constant velocity v and its edge RQ leaves the region of magnetic field at t = t0. Which of the graphs shown in figure represents the variation of induced current i with time t?",
      "image": "16.png",
      "qOptions": ["graph 1", "graph 2", "graph 3", "graph 4"],
      "qAnswer": "B"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "",
      "image": "17.png",
      "qOptions": ["graph 1", "graph 2", "graph 3", "graph 4"],
      "qAnswer": "B"
    },
    {
      "qType": "Passage",
      "passageId": "P1",
      "qText": "Comprehension\n\nA wire frame in the form of a part of circle (sector) of radius \\(\\ell\\) and resistance R is free to rotate about an axis passing through O and perpendicular to plane of paper as shown in figure. The angle of the sector is \\(\\pi/4\\) and it is rotating with a constant velocity \\(\\omega\\) as shown. Above line PQ, uniform magnetic field of magnitude B exists in the direction perpendicular to plane of paper. In region I field is outward while in region II , field is inward.\n\nBased on above information, answer the following questions:",
      "image": "p1.png",
      "qOptions": [],
      "qAnswer": []
    },
    {
      "qType": "SMCQ",
      "passageId": "P1",
      "qText": "I. The thermal energy dissipated in wire frame when it moves from region I to region II, is",
      "image": null,
      "qOptions": [
        "\\(\\dfrac{B^{2}\\omega \\pi \\ell^{4}}{16R}\\)",
        "\\(\\dfrac{B^{2}\\omega \\pi \\ell^{4}}{4R}\\)",
        "\\(\\dfrac{3B^{2}\\omega \\pi \\ell^{4}}{8R}\\)",
        "\\(\\dfrac{3B^{2}\\omega \\pi \\ell^{4}}{16R}\\)"
      ],
      "qAnswer": "B"
    },
    {
      "qType": "SMCQ",
      "passageId": "P1",
      "qText": "II. Total thermal energy dissipated in one cycle is",
      "image": null,
      "qOptions": [
        "\\(\\dfrac{B^{2}\\omega \\pi \\ell^{4}}{16R}\\)",
        "\\(\\dfrac{B^{2}\\omega \\pi \\ell^{4}}{4R}\\)",
        "\\(\\dfrac{3B^{2}\\omega \\pi \\ell^{4}}{8R}\\)",
        "\\(\\dfrac{3B^{2}\\omega \\pi \\ell^{4}}{16R}\\)"
      ],
      "qAnswer": "C"
    },
    {
      "qType": "SMCQ",
      "passageId": "P1",
      "qText": "III. Average power produced in wire frame is",
      "image": null,
      "qOptions": [
        "\\(\\dfrac{3B^{2}\\omega^{2}\\ell^{4}}{16R}\\)",
        "\\(\\dfrac{B^{2}\\omega^{2}\\ell^{4}}{16R}\\)",
        "\\(\\dfrac{B^{2}\\omega^{2}\\ell^{4}}{8R}\\)",
        "\\(\\dfrac{B^{2}\\omega^{2}\\ell^{4}}{8R}\\)"
      ],
      "qAnswer": "A"
    },
    {
      "qType": "Numerical",
      "passageId": null,
      "qText": "A plane spiral coil is made of a thin insulated wire and has N = 100 turns. Radii of inside and outside turns are a = 10 cm and b = 20 cm respectively. A magnetic field normal to the plane of the spiral exists in the space. The magnetic field increases at a constant rate \\(\\alpha = 0.3\\) tesla/sec. Find the potential difference between ends of spiral.",
      "image": "19.png",
      "qOptions": [],
      "qAnswer": 2.2
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "A wire bent as a parabola \\(y = kx^2\\) is located in a uniform magnetic field of induction B, the vector \\(\\vec B\\) being perpendicular to the x-y plane. At the moment t = 0 a connector starts sliding translation wise from the parabola apex with a constant acceleration “a”. Find the emf of electromagnetic induction in the loop thus formed as a function of y.",
      "image": "20.png",
      "qOptions": [
        "\\(\\varepsilon = B y \\sqrt{\\dfrac{4a}{k}}\\)",
        "\\(\\varepsilon = B y \\sqrt{\\dfrac{12a}{k}}\\)",
        "\\(\\varepsilon = B y \\sqrt{\\dfrac{2a}{k}}\\)",
        "\\(\\varepsilon = B y \\sqrt{\\dfrac{8a}{k}}\\)"
      ],
      "qAnswer": "D"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "A square wire frame with side a and a straight conductor carrying a constant current I are located in the same plane. The inductance and the resistance of the frame are equal to L and R respectively. The frame was turned through 180\\(^{\\circ}\\) about the axis OO' separated from the current – carrying conductor by a distance b. Find the electric charge having flown through the frame.\n\n(Options are made-up distractors; one is correct.)",
      "image": "21.png",
      "qOptions": [
        "\\(\\dfrac{\\mu_0 I a}{2\\pi R}\\ln\\!\\left(\\dfrac{b+a}{b-a}\\right)\\)",
        "\\(\\dfrac{\\mu_0 I a}{\\pi R}\\ln\\!\\left(\\dfrac{b}{a}\\right)\\)",
        "\\(\\dfrac{\\mu_0 I}{2\\pi R}\\ln\\!\\left(\\dfrac{b+a}{a}\\right)\\)",
        "\\(\\dfrac{\\mu_0 I a}{2\\pi R}\\left(\\dfrac{b+a}{b-a}\\right)\\)"
      ],
      "qAnswer": "A"
    },
    {
      "qType": "Numerical",
      "passageId": null,
      "qText": "Some magnetic flux is changed from a coil of resistance 10 \\(\\Omega\\). As a result an induced current is developed in it, which varies with time as shown in figure. Find the magnitude of change in Coulomb that flows through the coil.",
      "image": "22.png",
      "qOptions": [],
      "qAnswer": 0.2
    },
    {
      "qType": "Passage",
      "passageId": "P2",
      "qText": "A flat coil, C of n turns, area A and resistance R is place in a uniform magnetic field of magnitude B. The plane of the coil is initially perpendicular to B. If the coil is rotated by an angle \\(\\theta\\) about the axis x – y, charge of amount Q flows through it. If :",
      "image": "23.png",
      "qOptions": [],
      "qAnswer": []
    },
    {
      "qType": "MMCQ",
      "passageId": "P2",
      "qText": "",
      "image": null,
      "qOptions": [
        "\\(\\theta = 90^{\\circ}, Q = (BAn / R)\\)",
        "\\(\\theta = 180^{\\circ}, Q = (BAn / R)\\)",
        "\\(\\theta = 180^{\\circ}, Q = 0\\)",
        "\\(\\theta = 360^{\\circ}, Q = 0\\)"
      ],
      "qAnswer": ["A", "D"]
    },
    {
      "qType": "MMCQ",
      "passageId": "P2",
      "qText": "In the above question, the plane of the coil is initially kept parallel to B and all other details remain the same. If",
      "image": null,
      "qOptions": [
        "\\(\\theta = 90^{\\circ}, Q = (BAn / R)\\)",
        "\\(\\theta = 180^{\\circ}, Q = (2BAn / R)\\)",
        "\\(\\theta = 180^{\\circ}, Q = 0\\)",
        "\\(\\theta = 360^{\\circ}, Q = 0\\)"
      ],
      "qAnswer": ["A", "C", "D"]
    },
    {
      "qType": "SMCQ",
      "passageId": "P2",
      "qText": "In the previous question, if the coil rotates about x-y with a constant angular velocity \\(\\omega\\), the emf induced in it:",
      "image": null,
      "qOptions": [
        "is zero",
        "changes non-linearly with time",
        "has a constant value = \\(BAn \\omega\\)",
        "has a maximum value = \\(BAn \\omega\\)"
      ],
      "qAnswer": "D"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "A square frame of side a and a long straight wire carrying a current I are located in the same plane. The frame is rotated through an angle of 90\\(^{\\circ}\\) about side PQ. Find the amount of charge flown through the frame. Resistance of the frame is R.",
      "image": "26.png",
      "qOptions": [
        "\\(\\dfrac{\\mu_0 I a \\ln \\sqrt{2}}{2\\pi R}\\)",
        "\\(\\dfrac{\\mu_0 I a \\ln \\sqrt{2}}{\\pi R}\\)",
        "\\(\\dfrac{2\\mu_0 I a \\ln \\sqrt{2}}{\\pi R}\\)",
        "\\(\\dfrac{\\mu_0 I a \\ln(1/\\sqrt{2})}{\\pi R}\\)"
      ],
      "qAnswer": "A"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "Circular coil is placed between two long current wire carrying current I in opposite directions as shown in fig. The plane of the wires are perpendicular to the plane of circle. The flux passing through the circular coil is",
      "image": "27.png",
      "qOptions": [
        "\\(\\left(\\dfrac{\\mu_0}{4\\pi}\\right) \\dfrac{2}{R^2}\\)",
        "Zero",
        "\\(\\left(\\dfrac{\\mu_0}{4\\pi}\\right) \\dfrac{2R}{(1+R^2)}\\)",
        "None of the above."
      ],
      "qAnswer": "B"
    },
    {
      "qType": "MMCQ",
      "passageId": null,
      "qText": "In the above question",
      "image": "30.png",
      "qOptions": [
        "e = 0, if v is the y-direction and B is in the x-direction",
        "e = 2Bav, if v is in the y-direction and B is in the x – direction.",
        "E = B \\lambda v, if v is in the z – direction and B is in the x – direction",
        "E = 2 B \\lambda v, if v is the x-direction and B is in the z – direction"
      ],
      "qAnswer": ["A", "C", "D"]
    },
    {
      "qType": "MMCQ",
      "passageId": null,
      "qText": "A conductor AD moves to the right in a uniform magnetic field directed into the paper",
      "image": "31.png",
      "qOptions": [
        "the free electrons in AD will move towards D.",
        "A will acquire a positive potential.",
        "the current is AD flows from lower to higher potential.",
        "None of the above is correct."
      ],
      "qAnswer": ["B", "C"]
    },
    {
      "qType": "Numerical",
      "passageId": null,
      "qText": "A square metal wire loop of side 10 cm and resistance 10 \\(\\Omega\\) is moved with a constant velocity \\(v_s\\) in a uniform magnetic field of induction \\(B = 2\\) weber/m\\(^2\\) as shown in the figure. The magnetic field lines are perpendicular to the plane of the loop. The loop is connected to a network of resistors each of value 3 ohms. The resistances of the lead wires OS and PQ are negligible. What should be the speed of the loop so as to have a steady current of 1 milliampere in the loop? (in cm/s) Write the first digit of answer.",
      "image": "32.png",
      "qOptions": [],
      "qAnswer": 6.5
    },
    {
      "qType": "Numerical",
      "passageId": null,
      "qText": "A rectangular loop with a sliding connector of length \\( l = 1.0\\,\\text{m} \\) is situated in a uniform magnetic field \\( B = 2T \\) connector is \\( r = 2\\,\\Omega \\). Two resistances of \\( 6\\,\\Omega \\) and \\( 3\\,\\Omega \\) are connected as shown in figure. Find the external force required to keep the connector moving with a constant velocity \\( v = 2\\,\\text{m/s} \\).",
      "image": "33.png",
      "qOptions": [],
      "qAnswer": 2
    },
    {
      "qType": "Numerical",
      "passageId": null,
      "qText": "A sliding wire of length 0.25 meter and negligible resistance moves along conducting rails AB and CD with a uniform speed of 4m/s. A magnetic field of 1.5 Tesla exists normal to the plane ABCD directed into the page. The conducting rails are short circuit with resistance of 6\\(\\Omega\\) and 2\\(\\Omega\\) as shown. The current through the sliding wire is",
      "image": "34.png",
      "qOptions": [],
      "qAnswer": 1
    },
    {
      "qType": "Passage",
      "passageId": "P2",
      "qText": "A metal rod of mass m and of length l slides on frictionless rails of negligible resistance, which terminate in a resistor R as shown in the figure. A uniform magnetic field B is directed perpendicular to the plane of the rails. If the initial velocity of the rod is \\(v_0\\), and there is no external agent applying a force on the rod, then,",
      "image": "p2.png",
      "qOptions": [],
      "qAnswer": []
    },
    {
      "qType": "SMCQ",
      "passageId": "P2",
      "qText": "I. Find the instantaneous velocity of the rod.\n\n(Options are made-up distractors; one is correct.)",
      "image": null,
      "qOptions": [
        "\\(v(t)=v_0 e^{-ct}\\)",
        "\\(v(t)=v_0(1-ct)\\)",
        "\\(v(t)=\\dfrac{v_0}{1+ct}\\)",
        "\\(v(t)=v_0 e^{ct}\\)"
      ],
      "qAnswer": "A"
    },
    {
      "qType": "SMCQ",
      "passageId": "P2",
      "qText": "II. Find the distance travelled by the rod before it stops.\n\n(Options are made-up distractors; one is correct.)",
      "image": null,
      "qOptions": [
        "\\(\\dfrac{v_0 m R}{B^2 l^2}\\)",
        "\\(\\dfrac{mR}{B^2 l^2}\\)",
        "\\(\\dfrac{v_0^2 m R}{2 B^2 l^2}\\)",
        "\\(\\dfrac{v_0 m}{B^2 l^2}\\)"
      ],
      "qAnswer": "A"
    },
    {
      "qType": "SMCQ",
      "passageId": "P2",
      "qText": "III. Find the total energy dissipated in the resistor.\n\n(Options are made-up distractors; one is correct.)",
      "image": null,
      "qOptions": [
        "\\(\\dfrac{1}{2} m v_0^2\\)",
        "\\(m v_0^2\\)",
        "\\(\\dfrac{1}{2} m v_0\\)",
        "\\(\\dfrac{1}{4} m v_0^2\\)"
      ],
      "qAnswer": "A"
    },
    {
      "qType": "Passage",
      "passageId": "P3",
      "qText": "Two parallel vertical metallic rails AB and CD are separated by 1m. They are connected at the two ends by resistances R1 and R2 as shown. A horizontal metallic bar L of mass 0.2 kg slides without friction, vertically down the rails under the action of gravity. There is a uniform horizontal magnetic field of 0.6 T perpendiculars to the plane of rails. It is observed that when the terminal velocity is attained. The powers dissipated in R1 and R2 are 0.76 W and 1.2 W respectively. Find the terminal velocity of the bar L and the value of R1 and R2.",
      "image": "p3.png",
      "qOptions": [],
      "qAnswer": []
    },
    {
      "qType": "Numerical",
      "passageId": "P3",
      "qText": "The terminal velocity of the bar is (use the data of Passage P3).",
      "image": null,
      "qOptions": [],
      "qAnswer": 0.98
    },
    {
      "qType": "Numerical",
      "passageId": "P3",
      "qText": "The value of \\(R_1\\) is (use the data of Passage P3).",
      "image": null,
      "qOptions": [],
      "qAnswer": 0.455
    },
    {
      "qType": "Numerical",
      "passageId": "P3",
      "qText": "The value of \\(R_2\\) is (use the data of Passage P3).",
      "image": null,
      "qOptions": [],
      "qAnswer": 0.288
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "Two conducting rails separated by a distance \\(\\ell\\) are joined at the top by a resistance R. The rails are inclined at an angle \\(\\theta\\) with horizontal. A conducting wire MN of mass m and length \\(\\ell\\) . Slides without friction on rails with constant speed v. The conducting wire and rails have no resistance. A uniform magnetic field \\(\\vec B\\) acts horizontally and perpendicular to the wire MN. Find value of the magnetic field B.",
      "image": "37.png",
      "qOptions": [
        "\\(\\dfrac{mgR}{BL}\\)",
        "\\(\\sqrt{\\dfrac{mgR}{B\\,\\ell}}\\)",
        "\\(\\sqrt{\\dfrac{mgR}{\\ell^{2} v \\sin \\theta}}\\)",
        "\\(\\dfrac{mgR}{B^{2}\\ell^{2}}\\)"
      ],
      "qAnswer": "C"
    },
    {
      "qType": "Passage",
      "passageId": "P4",
      "qText": "A pair of parallel horizontal conducting rails of negligible resistance shorted at one end is fixed on a table. The distance between the rails is L. A conducting massless rod of resistance R can slide on the rails without friction. The rod is tied to a massless string which passes over a pulley fixed to the edge of the table. A mass m, tied to the other end of the string, hangs vertically. A constant magnetic field B exists perpendicular to the table. The system is released from rest.",
      "image": "p4.png",
      "qOptions": [],
      "qAnswer": []
    },
    {
      "qType": "SMCQ",
      "passageId": "P4",
      "qText": "The acceleration of the mass m moving in the downward direction is",
      "image": null,
      "qOptions": [
        "g",
        "\\(\\dfrac{B^{2}L^{2}v}{mR}\\)",
        "\\( g - \\dfrac{B^{2}L^{2}v}{mR} \\)",
        "\\( g + \\dfrac{B^{2}L^{2}v}{mR} \\)"
      ],
      "qAnswer": "C"
    },
    {
      "qType": "SMCQ",
      "passageId": "P4",
      "qText": "The terminal velocity acquired by the rod is",
      "image": null,
      "qOptions": [
        "g",
        "\\(\\sqrt{gR}\\)",
        "\\(\\sqrt{\\dfrac{mgR}{BL}}\\)",
        "\\(\\dfrac{mgR}{B^{2}L^{2}}\\)"
      ],
      "qAnswer": "D"
    },
    {
      "qType": "SMCQ",
      "passageId": "P4",
      "qText": "The acceleration of mass m when the velocity of the rod is half the terminal velocity is",
      "image": null,
      "qOptions": [
        "g",
        "\\(\\dfrac{g}{2}\\)",
        "\\(\\dfrac{g}{3}\\)",
        "\\(\\dfrac{g}{4}\\)"
      ],
      "qAnswer": "B"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "The arrangement shown is placed in a uniform vertical field of strength 3 tesla. Initially both the rods are at rest. The system is released at t = 0. Find the velocity of the rod of mass m as a function of time. Neglect friction. Take m = 1 kg.\n\n(Options are made-up distractors; one is correct.)",
      "image": "39.png",
      "qOptions": [
        "\\(v_1=\\dfrac{g}{2}\\left(t+\\dfrac{e^{ct}-1}{c}\\right),\\; c=\\dfrac{6B^{2}\\ell^{2}}{5mR}\\)",
        "\\(v_1=\\dfrac{g}{2}\\left(t-\\dfrac{e^{ct}-1}{c}\\right)\\)",
        "\\(v_1=g\\left(t+\\dfrac{e^{ct}-1}{c}\\right)\\)",
        "\\(v_1=\\dfrac{g}{4}\\left(t+\\dfrac{e^{ct}-1}{c}\\right)\\)"
      ],
      "qAnswer": "A"
    },
    {
      "qType": "Numerical",
      "passageId": null,
      "qText": "A rectangular wire frame of dimensions (0.25m \\(\\times\\) 2.0 m) and mass 0.5 kg falls from a height 5m above a region occupied by uniform magnetic field of magnetic induction 1 T. The resistance of the wire frame is \\(\\dfrac{1}{8}\\,\\Omega\\). Find the time taken by the wire frame when it just starts coming out of the magnetic field.",
      "image": "40.png",
      "qOptions": [],
      "qAnswer": 2.7
    },
    {
      "qType": "Passage",
      "passageId": "P5",
      "qText": "Two long parallel horizontal rails, a distance 20 cm apart, each having a resistance 0.2 / m per unit length, are joined at one end by a resistance 500 \\(\\Omega\\). A perfectly conducting rod MN of mass 0.2 kg is free to slide along the rails without friction. There is a uniform magnetic field of induction 50T normal to the plane of the paper and directed into it. A variable force F is applied such that a constant current, 2 Amp, flows through R.",
      "image": "p5.png",
      "qOptions": [],
      "qAnswer": []
    },
    {
      "qType": "SMCQ",
      "passageId": "P5",
      "qText": "(a) Find the magnetic force FM on the rod, and the induced emf as a function of the distance, 10 cm.",
      "image": null,
      "qOptions": [
        "FM = I \\ell B ; \\; \\varepsilon = B \\ell v",
        "FM = I \\ell / B ; \\; \\varepsilon = B \\ell v",
        "FM = I B / \\ell ; \\; \\varepsilon = I R",
        "FM = I \\ell B ; \\; \\varepsilon = I R"
      ],
      "qAnswer": "A"
    },
    {
      "qType": "SMCQ",
      "passageId": "P5",
      "qText": "(b) Find the velocity of the rod, and the applied force F as a function of the distance 10 cm of the rod from R.",
      "image": null,
      "qOptions": [
        "v = \\dfrac{2 (k+2\\lambda x)}{B\\ell} ; \\; F = I \\ell B + \\dfrac{m (R+2\\lambda x) g \\lambda}{B^{2}\\ell^{2}}",
        "v = \\dfrac{k+2\\lambda x}{B\\ell} ; \\; F = I \\ell B",
        "v = \\dfrac{2 (k+2\\lambda x)}{B\\ell^{2}} ; \\; F = I \\ell B",
        "v = \\dfrac{B\\ell}{2 (k+2\\lambda x)} ; \\; F = I \\ell B"
      ],
      "qAnswer": "A"
    },
    {
      "qType": "SMCQ",
      "passageId": "P5",
      "qText": "(c) What fraction of the work done by F is converted into heat?",
      "image": null,
      "qOptions": [
        "1",
        "\\(\\dfrac{1}{2}\\)",
        "\\(\\dfrac{R}{R+\\lambda x}\\)",
        "\\(\\dfrac{\\lambda x}{R+\\lambda x}\\)"
      ],
      "qAnswer": "B"
    },
    {
      "qType": "Passage",
      "passageId": "P6",
      "qText": "A infinite V – shaped wire has a linear resistance \\(\\lambda\\) (Resistance per unit length). Another infinite wire whose linear resistance is \\(\\lambda\\), sliding on the V – shaped wire with a velocity “V” as shown in figure. (Neglect the friction between wire and Induction effect). A uniform magnetic field exists perpendicular to x y plane.(At any instant of time t answer the following)",
      "image": "p6.png",
      "qOptions": [],
      "qAnswer": []
    },
    {
      "qType": "SMCQ",
      "passageId": "P6",
      "qText": "The current is the loop",
      "image": null,
      "qOptions": [
        "\\(\\dfrac{2B v^{2} t}{\\sqrt{3}\\,\\lambda}\\)",
        "\\(\\dfrac{2\\sqrt{3} B v t}{\\lambda}\\)",
        "\\(\\dfrac{B v t}{3\\lambda}\\)",
        "None of these"
      ],
      "qAnswer": "D"
    },
    {
      "qType": "SMCQ",
      "passageId": "P6",
      "qText": "The force required per unit time to move with constant velocity",
      "image": null,
      "qOptions": [
        "\\(\\dfrac{B^{2} v^{2} t^{2}}{3\\sqrt{3}\\,\\lambda}\\)",
        "\\(\\dfrac{B^{2} v^{2} t^{2}}{\\sqrt{3}\\,\\lambda}\\)",
        "\\(\\dfrac{2 B^{2} v^{2}}{3\\sqrt{3}\\,\\lambda}\\)",
        "\\(\\dfrac{2 B^{2} v^{2}}{\\sqrt{3}\\,\\lambda}\\)"
      ],
      "qAnswer": "C"
    },
    {
      "qType": "SMCQ",
      "passageId": "P6",
      "qText": "Heat produced in the conductors till time t' is",
      "image": null,
      "qOptions": [
        "\\(\\dfrac{B^{2} v^{2} t'^{2}}{3\\sqrt{3}\\,\\lambda}\\)",
        "\\(\\dfrac{2B^{2} v^{2} t'}{3\\sqrt{3}\\,\\lambda}\\)",
        "\\(\\dfrac{2B^{2} v t'^{2}}{9\\lambda}\\)",
        "none of these"
      ],
      "qAnswer": "A"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "A conduction rod AC of length ‘4l’ is rotated about a point O in a uniform magnetic field \\(\\vec B\\) directed in the plane of paper. Take AO = l, OC = 3l then",
      "image": "43.png",
      "qOptions": [
        "VC – VO = \\(\\dfrac{B\\omega \\ell^{2}}{2}\\)",
        "VO – VC = \\(\\dfrac{9}{2} B\\omega \\ell/2\\)",
        "VC – VO = none of these",
        "none of these."
      ],
      "qAnswer": "B"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "Two thin semicircular ring of radius R/2 are smoothly joined, and is falling (translating) with its plane vertical in a horizontal magnetic induction B. At the position MNQ the speed of ring is V. The potential difference developed across the points M and Q is",
      "image": "44.png",
      "qOptions": [
        "zero",
        "2BVR and M is at higher potential",
        "RBV and Q is at higher potential",
        "2RBV and Q is at higher potential"
      ],
      "qAnswer": "D"
    },
    {
      "qType": "Passage",
      "passageId": "P7",
      "qText": "A metallic rod of length l & resistance R is free to rotate about one of its ends over a horizontal smooth, rigid circular metallic frame of radius l in an inward magnetic field of induction B.The circuit is completed by means of a conducting wire connected between the centre O and the point on the ring. What torque should be applied by an external agent to rotate the rod with constant angular velocity? What is the power expenditure of the external agent?",
      "image": "p7.png",
      "qOptions": [],
      "qAnswer": []
    },
    {
      "qType": "SMCQ",
      "passageId": "P7",
      "qText": "The torque to be applied by the external agent is\n\n(Options are made-up distractors; one is correct.)",
      "image": null,
      "qOptions": [
        "\\(\\tau=\\dfrac{B^{2}\\omega \\ell^{4}}{4R}\\)",
        "\\(\\tau=\\dfrac{B^{2}\\omega^{2}\\ell^{4}}{4R}\\)",
        "\\(\\tau=\\dfrac{B^{2}\\omega \\ell^{3}}{R}\\)",
        "\\(\\tau=\\dfrac{B \\omega \\ell^{4}}{4R}\\)"
      ],
      "qAnswer": "A"
    },
    {
      "qType": "SMCQ",
      "passageId": "P7",
      "qText": "The power expenditure of the external agent is\n\n(Options are made-up distractors; one is correct.)",
      "image": null,
      "qOptions": [
        "\\(P=\\dfrac{B^{2}\\omega^{2}\\ell^{4}}{4R}\\)",
        "\\(P=\\dfrac{B^{2}\\omega^{2}\\ell^{4}}{4R}\\)",
        "\\(P=\\dfrac{B \\omega^{2}\\ell^{4}}{4R}\\)",
        "\\(P=\\dfrac{B^{2}\\omega^{2}\\ell^{3}}{4R}\\)"
      ],
      "qAnswer": "A"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "A semicircular conducting rod of radius r is rotated about one of its free end in a uniform magnetic field B at constant angular velocity \\(\\omega\\). Emf induced across its ends is equal to",
      "image": "46.png",
      "qOptions": [
        "zero",
        "2B \\(\\omega R^{2}\\)",
        "\\((1/2)B \\omega R^{2}\\)",
        "B \\(\\omega R^{2}\\)"
      ],
      "qAnswer": "B"
    },
    {
      "qType": "Numerical",
      "passageId": null,
      "qText": "A conducting rod AB of length \\(l = 1\\,\\text{m}\\) is moving at a velocity \\(v = 4\\,\\text{m/s}\\) making an angle 30\\(^{\\circ}\\) with its length. A uniform magnetic field \\(B = 2T\\) exists in direction perpendicular to the plane of motion. Find the value of \\(V_A – V_B\\).",
      "image": "47.png",
      "qOptions": [],
      "qAnswer": 4
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "A conducting rod of length l attached to a rod of insulating material of length L is rotated with constant angular speed in a plane normal to the uniform magnetic field B, as shown in the figure. Find the emf produced across the ends of the conducting rod.\n\n(Options are made-up distractors; one is correct.)",
      "image": "48.png",
      "qOptions": [
        "\\(\\dfrac{B\\,\\omega\\,\\ell^{2}}{2}\\)",
        "\\(\\dfrac{B\\,\\omega\\,\\ell^{2}}{4}\\)",
        "\\(B\\,\\omega\\,\\ell^{2}\\)",
        "\\(\\dfrac{B\\,\\omega\\,L^{2}}{2}\\)"
      ],
      "qAnswer": "A"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "A conducting ring of radius r is rolling without slipping with a constant angular velocity \\(\\omega\\). If the magnetic field strength is B and is directed into the page then find emf induced across PQ.\n\n(Options are made-up distractors; one is correct.)",
      "image": "49.png",
      "qOptions": [
        "\\(B\\,\\omega\\,R^{2}\\)",
        "\\(\\dfrac{B\\,\\omega\\,R^{2}}{2}\\)",
        "\\(2B\\,\\omega\\,R^{2}\\)",
        "\\(\\dfrac{B\\,\\omega\\,R}{2}\\)"
      ],
      "qAnswer": "A"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "A ring of radius r and resistance R is falling between two parallel rails with velocity v shown in figure. The upper end of rails is shorted. A uniform magnetic field B which is perpendicular to the plane of ring, exists in the region. The current through rails is (Assuming rails are of zero resistance",
      "image": "50.png",
      "qOptions": [
        "\\(\\dfrac{4Bvr}{R}\\) along BA",
        "\\(\\dfrac{2Bvr}{R}\\) along BA",
        "\\(\\dfrac{4Bvr}{R}\\) along AB",
        "\\(\\dfrac{8Bvr}{R}\\) along AB"
      ],
      "qAnswer": "A"
    },
    {
      "qType": "Numerical",
      "passageId": null,
      "qText": "A conducting rod of length 1 m aligned along the unit vector \\(\\left(\\dfrac{3}{5}\\,\\hat i + \\dfrac{4}{5}\\,\\hat k\\right)\\), is moving with a velocity \\(\\vec v = (2\\,\\hat i)\\,\\text{m/s}\\). The motion take place in a uniform magnetic field \\(\\vec B = (\\hat j - 2\\hat k)\\,\\text{tesla}\\). Find the magnitude of induced emf in across the rod in volt.",
      "image": "51.png",
      "qOptions": [],
      "qAnswer": 4
    }
  ]
}
