{
  "questions": [
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "In a gravity free space, a sufficiently long rod of mass m and resistance per unit length λ slides on a fixed resistance less parabolic conductor as shown. A uniform magnetic field \\(\\vec{B} = -B_0 \\hat{k}\\) exists in whole space. Rod is initially symmetrically placed along the x-axis as shown and is given an initial velocity \\(v_0 \\hat{j}\\). Find the distance moved by the rod before it comes to rest for the first time.",
      "image": "1.png",
      "qOptions": [
        "\\(\\left( \\frac{3m^2 \\lambda^2 v_0^2}{16 B_0^2 a} \\right)^{1/3}\\)",
        "\\(\\left( \\frac{9m^2 \\lambda^2 v_0^2}{64 B_0^2 a} \\right)^{1/3}\\)",
        "\\(\\left( \\frac{16m^2 \\lambda^2 v_0^2}{3B_0^2 a} \\right)^{1/3}\\)",
        "\\(\\left( \\frac{16m^2 \\lambda^2 v_0^2}{9B_0^2 a} \\right)^{1/3}\\)"
      ],
      "qAnswer": "B"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "A nonuniform and constant magnetic field is present in space along negative z-direction, such that the magnitude of the magnetic flux per unit area in x-y plane is \\(\\phi_1\\) at \\(x = x_1\\) and \\(\\phi_2\\) at \\(x = x_1 + L\\). A square wire frame of side L placed in xy-plane moves along positive x-direction with a velocity v such that its sides are parallel to the x and y axes. The magnitude of emf induced in the frame at the instant its two sides are at \\(x = x_1\\) and \\(x = x_1 + L\\), is:",
      "image": null,
      "qOptions": [
        "\\(|\\phi_2 + \\phi_1| L v\\)",
        "\\(\\frac{|\\phi_2 \\; \\phi_1|}{|\\phi_2 - \\phi_1|} L v\\)",
        "\\(|\\phi_2 - \\phi_1| L v\\)",
        "\\(\\frac{|\\phi_2 + \\phi_1|}{2} L v\\)"
      ],
      "qAnswer": "C"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "A uniform magnetic field \\(\\vec{B} = 0.1 (-\\hat{k})\\,\\text{T}\\) exists on the left side of plane \\(x = 0\\). A rectangular wire frame ABCD whose sides are 40 cm and 10 cm respectively, starts moving towards positive x-axis with uniform velocity 5 m/s due to presence of variable external force \\(\\vec{F}\\) at \\(t = 0\\) sec as shown in the figure. The graphs between power generated by external force versus time will be:",
      "image": "3.png",
      "qOptions": ["Graph (A)", "Graph (B)", "Graph (C)", "None of these"],
      "qAnswer": "D"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "A metallic disc of radius r is made of a material of negligible resistance and can rotate about a conducting horizontal shaft. A smaller non conducting disc of radius a is fixed onto the same shaft and has a massless cord wrapped around it, which is attached to a small object of mass m as shown. Two ends of a resistor of resistance R are connected to the perimeter of the disc and to the shaft by sliding contacts. The system is then placed into a uniform horizontal magnetic field B and the mass m is released. Find the terminal angular velocity with which the disc will rotate finally. (Take r = 10 cm, a = 2 cm, R = 1/100 Ω, B = 0.2 T, m = 50 gm, g = 10 m/s²)",
      "image": "4.png",
      "qOptions": ["200 rad/s", "300 rad/s", "100 rad/s", "10 rad/s"],
      "qAnswer": "C"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "A conductor of length 5 cm and resistance 2 Ω is moving on frictionless rails with a constant velocity of 5 cm/s in a magnetic field of intensity 3 T as shown. If the conductor is connected to the circuit shown by two lead wires of almost negligible resistance, the current flowing in it is:",
      "image": "5.png",
      "qOptions": ["0.25 A", "2.5 A", "2.5 mA", "0.25 × 10^4 A"],
      "qAnswer": "C"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "Two identical conducting planes of length a and width b are placed parallel on opposite sides of a river at a distance d apart, as shown. The river flows with velocity v. The vertical component of Earth's magnetic field is B_v and the resistivity of river water is ρ. The plates are connected by a load resistance R. Find the current through the load R.",
      "image": "7.png",
      "qOptions": [
        "\\(\\dfrac{B_v v b}{R}\\)",
        "\\(\\dfrac{B_v v b}{\\,R + \\dfrac{\\rho d}{ab}\\,}\\)",
        "\\(\\dfrac{B_v v d}{\\,R + \\dfrac{\\rho d}{ab}\\,}\\)",
        "none of the above"
      ],
      "qAnswer": "B"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "A wire of mass m can slide without friction on two parallel rails. A capacitor C is connected across the rails as shown. A time-dependent force F = k t is applied parallel to the rod PQ. A uniform magnetic field B exists perpendicular to the plane of the rails (into the page). Which graph best represents the variation of current in the circuit with time?",
      "image": "8.png",
      "qOptions": ["Graph (A)", "Graph (B)", "Graph (C)", "Graph (D)"],
      "qAnswer": "A"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "As shown, a uniform magnetic field B exists into the plane of the paper. A ring of radius ℓ and total resistance R is fixed. Rods OA and OB are resistanceless and rotate with constant angular velocity ω in the same plane as the ring about the hinge point O. The separation between O and C (centre of ring) is 2ℓ. Find the current in rod OA when both rods become tangent to the ring.",
      "image": "9.png",
      "qOptions": [
        "zero",
        "\\(\\dfrac{17 B \\omega \\ell^{2}}{2R}\\)",
        "\\(\\dfrac{27 B \\omega \\ell^{2}}{4R}\\)",
        "\\(\\dfrac{27 B \\omega \\ell^{2}}{2R}\\)"
      ],
      "qAnswer": "C"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "A conducting wire frame is placed in a magnetic field directed into the plane of the paper. The magnetic field is increasing at a constant rate. What are the directions of the induced currents in the straight segments AB and CD?",
      "image": "10.png",
      "qOptions": [
        "B to A and D to C",
        "A to B and C to D",
        "A to B and D to C",
        "B to A and C to D"
      ],
      "qAnswer": "C"
    },
    {
      "qType": "SMCQ",
      "passageId": null,
      "qText": "A conducting ring of radius r and resistance R rolls on a horizontal surface with constant velocity v in a uniform magnetic field B normal to the plane of the loop. Choose the correct option.",
      "image": "11.png",
      "qOptions": [
        "The induced emf between O and Q is \\(B r v\\).",
        "An induced current \\(I=\\dfrac{2B v r}{R}\\) flows in the clockwise direction.",
        "An induced current \\(I=\\dfrac{2B v r}{R}\\) flows in the anticlockwise direction.",
        "No current flows."
      ],
      "qAnswer": "D"
    },
    {
      "qType": "MMCQ",
      "passageId": null,
      "qText": "In the figure, M is a fixed conducting ring of negligible resistance and radius a. PQ is a uniform rod of resistance r, hinged at the centre of the ring and rotated about this point in the clockwise direction with uniform angular velocity ω. A uniform magnetic field of strength B points inward (into the page). Then:",
      "image": "12.png",
      "qOptions": [
        "current through r is zero",
        "current through r is \\(\\dfrac{2 B \\omega a^{2}}{5 r}\\)",
        "direction of current in external resistance r is from centre to circumference",
        "direction of current in external resistance r is from circumference to centre"
      ],
      "qAnswer": ["B", "D"]
    },
    {
      "qType": "MMCQ",
      "passageId": null,
      "qText": "XX′ is a conducting rod that can slide freely on a U-shaped frame with total resistance R. A constant magnetic field B is perpendicular to the frame. A constant force is applied via a string so that the rod moves with constant velocity \\(\\vec v_0 = v_0(-\\hat i)\\). Then: \n\n (i) [FOR OPTIONS A AND B] the force of tension in the string on XX′ is ____. \n\n (ii) [FOR OPTIONS C AND D] If the directions of velocity and magnetic field are both reversed (magnitudes unchanged) and the same constant speed is maintained, then the force of tension becomes ____.",
      "image": "13.png",
      "qOptions": [
        "\\(\\dfrac{B^{2}\\,\\ell^{2}\\,v_0}{R}(-\\hat i)\\)",
        "\\(\\dfrac{B^{2}\\,\\ell\\,v_0^{2}}{R}(+\\hat i)\\)",
        "\\(\\dfrac{B^{2}\\,\\ell^{2}\\,v_0}{R}(+\\hat i)\\)",
        "\\(\\dfrac{B^{2}\\,\\ell\\,v_0^{2}}{R}(-\\hat i)\\)"
      ],
      "qAnswer": ["A", "C"]
    },
    {
      "qType": "MMCQ",
      "passageId": null,
      "qText": "A ring of mass m and radius R is set into pure rolling on a horizontal rough surface in a uniform magnetic field of strength B (into the page), as shown. A point charge q of negligible mass is attached to the rolling ring. Friction is sufficient so that it does not slip at any point. (θ is measured clockwise from the positive y-axis.)",
      "image": "14.png",
      "qOptions": [
        "Ring will continue to move with constant velocity.",
        "The value of friction acting on the ring is \\(B q v \\cos\\theta\\).",
        "The value of friction acting on the ring is \\(B q v \\sin\\theta\\).",
        "The ring will lose contact with the ground if \\(v > \\dfrac{mg}{2qB}\\)."
      ],
      "qAnswer": ["A", "C", "D"]
    },
    {
      "qType": "MMCQ",
      "passageId": null,
      "qText": "In the circuit shown, the wires P₁Q₁ and P₂Q₂ slide on the rails with the same speed of 5 cm s⁻¹. A uniform magnetic field of 1 T is into the page in the shaded region. Find the electric current in the 9 Ω resistor (state for the given motions).",
      "image": "15.png",
      "qOptions": [
        "zero if both wires slide toward left",
        "zero if both wires slide in opposite directions",
        "0.2 mA if both wires move toward left",
        "0.2 mA if both wires move in opposite directions"
      ],
      "qAnswer": ["B", "C"]
    },
    {
      "qType": "MMCQ",
      "passageId": null,
      "qText": "Two circular rings of radius a, each having resistance per unit length λ, move with uniform speed v along the x-axis in a uniform magnetic field \\(\\vec B = B_0(-\\hat{k})\\). At t = 0, the separation between the centres is just greater than 2a. At time t, when \\(\\angle AC_1B = 60^{\\circ}\\):",
      "image": "16.png",
      "qOptions": [
        "the force on any circular ring is \\(\\dfrac{72 B_0^{2} a v}{5\\pi\\,\\lambda}\\).",
        "the force on any circular ring is \\(\\dfrac{18 B_0^{2} a v}{5\\pi\\,\\lambda}\\).",
        "the current in branch BDA of a ring is \\(\\dfrac{3 B_0 v}{5\\pi\\,\\lambda}\\).",
        "the current in branch BDA of a ring is \\(\\dfrac{2 B_0 v}{5\\pi\\,\\lambda}\\)."
      ],
      "qAnswer": ["B", "C"]
    },
    {
      "qType": "MMCQ",
      "passageId": null,
      "qText": "CDEHGF EJC is a network of conducting rods. CD = CJ = 2ℓ, DH = JF = 3ℓ, and FG = HG = ℓ. All joints (C, D, E, F, G, H, J) are hinged so the rods can rotate freely in their plane. A uniform magnetic field B exists perpendicular to the plane (into the paper). Point C is fixed; point G is constrained to move along the line CE (perpendicular to the wall). A thin insulated copper wire is fastened along the rods to make a single-turn closed loop: starting from C → D → H via E, then back C via G, F, E, J (wire of uniform material & cross-section). At t = 0, G is at the left extreme so that C, E and G are almost coincident. From t = 0 onwards, G is moved at a slow constant speed v. At time t = (3√2 ℓ)/v (ignore inductance), choose the correct statements.",
      "image": "17.png",
      "qOptions": [
        "The ratio of magnitudes of emf in the parts CDEJC and EFGHE is 4.",
        "The current in the loop flows from F to E.",
        "The potential difference V_D − V_C equals \\(\\dfrac{B v \\ell \\sqrt{2}}{3}\\).",
        "The potential difference V_H − V_F is zero."
      ],
      "qAnswer": ["C", "D"]
    },
    {
      "qType": "Passage",
      "passageId": "P1",
      "qText": "A space shuttle uses magnetic force to reduce its acceleration while landing on a newly discovered planet. The gravitational acceleration near the surface is constant, directed perpendicular downward to the surface, with magnitude g. The planet also has a uniform magnetic field of magnitude B directed parallel to the surface. There is no atmosphere. The shuttle can be idealized as a thin conducting disc of mass m, radius R, and thickness d (with d ≪ R), as shown (faces x and y are flat). Neglect any eddy currents during motion.",
      "image": "19.png",
      "qOptions": [],
      "qAnswer": []
    },
    {
      "qType": "SMCQ",
      "passageId": "P1",
      "qText": "The amount of charge induced on a flat face (say x) of the shuttle during the fall, in terms of shuttle speed v, is",
      "image": null,
      "qOptions": [
        "\\(\\varepsilon_0\\pi R^2 d B v\\)",
        "\\(2\\,\\varepsilon_0\\pi R^2 d B v\\)",
        "\\(\\varepsilon_0\\pi R^2 d B v\\)",
        "\\(\\varepsilon_0\\pi R^2 d B^2 v\\)"
      ],
      "qAnswer": "A"
    },
    {
      "qType": "SMCQ",
      "passageId": "P1",
      "qText": "The magnetic force acting on the shuttle during the fall, in terms of the shuttle’s acceleration \\(a\\), is",
      "image": null,
      "qOptions": [
        "\\(\\varepsilon_0 \\pi R^2 B^2 d\\, a\\)",
        "\\(2\\,\\varepsilon_0 \\pi R^2 B^2 d\\, a\\)",
        "\\(\\varepsilon_0 \\pi R^2 B^2 d\\, a\\)",
        "\\(\\varepsilon_0 \\pi R^2 B^2 d\\, a\\)"
      ],
      "qAnswer": "B"
    },
    {
      "qType": "SMCQ",
      "passageId": "P1",
      "qText": "The acceleration of the space shuttle during the fall is",
      "image": null,
      "qOptions": [
        "\\(\\displaystyle \\frac{g}{1+\\dfrac{\\varepsilon_0 \\pi R^2 d\\, B^2}{m}}\\)",
        "\\(\\displaystyle \\frac{g}{1-\\dfrac{\\varepsilon_0 \\pi R^2 d\\, B^2}{m}}\\)",
        "\\(\\displaystyle \\frac{\\varepsilon_0 \\pi R^2 d\\, B^2}{m}\\, g\\)",
        "\\(\\displaystyle \\frac{\\varepsilon_0 \\pi R^2 d\\, B^2}{m}\\)"
      ],
      "qAnswer": "C"
    },
    {
      "qType": "Passage",
      "passageId": "P2",
      "qText": "Two long parallel conducting rails are placed in a uniform magnetic field. On one side, the rails are connected with a resistance R. Two rods MN and M'N' each having resistance r are placed across the rails as shown in the figure. Forces are applied on the rods MN and M'N' such that they move with constant velocity v.",
      "image": "20.png",
      "qOptions": [],
      "qAnswer": []
    },
    {
      "qType": "SMCQ",
      "passageId": "P2",
      "qText": "The current flowing through resistance R if both rods move with the same speed v toward the right is",
      "image": null,
      "qOptions": [
        "\\(\\frac{B l v}{R + (r/2)}\\)",
        "\\(\\frac{2 B l v}{R + r}\\)",
        "zero",
        "\\(\\frac{3 B l v}{2(R + r)}\\)"
      ],
      "qAnswer": "A"
    },
    {
      "qType": "SMCQ",
      "passageId": "P2",
      "qText": "The current flowing through resistance R if the rod MN moves toward the left and the rod M'N' moves toward the right is",
      "image": null,
      "qOptions": [
        "\\(\\frac{B l v}{R + (r/2)}\\)",
        "\\(\\frac{2 B l v}{R + r}\\)",
        "zero",
        "\\(\\frac{3 B l v}{2(R + r)}\\)"
      ],
      "qAnswer": "C"
    },
    {
      "qType": "SMCQ",
      "passageId": "P2",
      "qText": "If in the previous problem resistances of values \\(R_1\\) and \\(R_2\\) are connected on both ends as shown in the figure, the current \\(I\\) flowing through resistance \\(R_1\\) is given by",
      "image": "21.png",
      "qOptions": [
        "\\(\\frac{B l R_2 (v_1 v_2 - v_2 v_1)}{R_1 R_2 (r_1 + r_2) + r_2 R_1 (R_1 + R_2)}\\)",
        "\\(\\frac{B l R_2 (v_1 v_2 + v_2 v_1)}{R_1 R_2 (r_1 + r_2) + r_2 R_1 (R_1 + R_2)}\\)",
        "\\(\\frac{B l R_2 (v_1 v_2 - v_2 v_1)}{R_1 R_2 (r_1 - r_2) + r_2 R_1 (R_1 - R_2)}\\)",
        "\\(\\frac{B l R_2 (v_1 v_2 - v_2 v_1)}{R_1 R_2 (r_1 + r_2) - r_2 R_1 (R_1 + R_2)}\\)"
      ],
      "qAnswer": "A"
    },
    {
      "qType": "Passage",
      "passageId": "P3",
      "qText": "A wire loop enclosing a semicircle of radius R is located on the boundary of a uniform magnetic field B. At the moment t = 0, the loop is set into rotation with constant angular acceleration α about an axis O. The clockwise emf direction is taken to be positive.",
      "image": "22.png",
      "qOptions": [],
      "qAnswer": []
    },
    {
      "qType": "SMCQ",
      "passageId": "P3",
      "qText": "The variation of emf as a function of time is",
      "image": null,
      "qOptions": [
        "\\(\\frac{1}{2} B R^2 \\alpha t\\)",
        "\\(\\frac{3}{2} B R^2 \\alpha t\\)",
        "\\(\\sqrt{3} B R^2 \\alpha t\\)",
        "\\(\\frac{B R^2 \\alpha t}{\\sqrt{2}}\\)"
      ],
      "qAnswer": "A"
    },
    {
      "qType": "SMCQ",
      "passageId": "P3",
      "qText": "The variation of emf as a function of time is",
      "image": "23.png",
      "qOptions": ["a", "b", "c", "d"],
      "qAnswer": "B"
    },
    {
      "qType": "Passage",
      "passageId": "P4",
      "qText": "A frame ABCD is rotating with angular velocity ω about an axis which passes through the point O perpendicular to the plane of paper as shown in the figure. A uniform magnetic field B is applied into the plane of the paper in the region as shown. This was originally a match-the-following question, but here each item from Column I has been turned into a separate single-answer question.",
      "image": "24.png",
      "qOptions": [],
      "qAnswer": []
    },
    {
      "qType": "SMCQ",
      "passageId": "P4",
      "qText": "The potential difference between points A and O is:",
      "image": null,
      "qOptions": [
        "0",
        "\\(B \\omega L^2 / 2\\)",
        "\\(B \\omega L^2\\)",
        "\\(2B \\omega L^2\\)"
      ],
      "qAnswer": "C"
    },
    {
      "qType": "SMCQ",
      "passageId": "P4",
      "qText": "The potential difference between points O and D is:",
      "image": null,
      "qOptions": [
        "0",
        "\\(B \\omega L^2 / 2\\)",
        "\\(B \\omega L^2\\)",
        "\\(8B \\omega L^2\\)"
      ],
      "qAnswer": "C"
    },
    {
      "qType": "SMCQ",
      "passageId": "P4",
      "qText": "The potential difference between points C and D is:",
      "image": null,
      "qOptions": [
        "\\(B \\omega L^2 / 2\\)",
        "\\(B \\omega L^2\\)",
        "\\(2B \\omega L^2\\)",
        "\\(8B \\omega L^2\\)"
      ],
      "qAnswer": "A"
    },
    {
      "qType": "SMCQ",
      "passageId": "P4",
      "qText": "The potential difference between points A and D is:",
      "image": null,
      "qOptions": [
        "\\(B \\omega L^2 / 2\\)",
        "\\(B \\omega L^2\\)",
        "\\(2B \\omega L^2\\)",
        "\\(8B \\omega L^2\\)"
      ],
      "qAnswer": "D"
    },
    {
      "qType": "Numerical",
      "passageId": null,
      "qText": "Figure 3.210 shows a conducting rod of length l = 10 cm, resistance R and mass m = 100 mg moving vertically downward due to gravity. Other parts are fixed. The magnetic field is B = 1 T. MN and PQ are vertical, smooth, conducting rails. The capacitance of the capacitor is C = 10 mF. The rod is released from rest. Find the maximum current (in mA) in the circuit.",
      "image": "25.png",
      "qOptions": [],
      "qAnswer": 5
    },
    {
      "qType": "Numerical",
      "passageId": null,
      "qText": "Two parallel conducting rails are connected to a source of emf E and internal resistance r. Another conducting rod of length ℓ (negligible resistance) lies at rest and can slide without friction over the rails. A uniform magnetic field B is applied perpendicular to the plane of the rails. At t = 0, the rod is pulled along the rails by a force F. The velocity of the rod is observed to be v = v₀ cos(ωt). Find the power (in watt) spent by the force over 1 cycle. (Given B = 2 T, r = 2×10⁻⁴ Ω, v₀ = 2 m s⁻¹, ℓ = 1 cm.)",
      "image": "26.png",
      "qOptions": [],
      "qAnswer": 4
    }
  ]
}
